{
  "title": "Flatscreens",
  "artist": "Dylan Beattie and the Linebreakers",
  "genres": ["breakbeat", "electronic", "parody", "pop", "ppeech", "spoken word", "stage & screen", "synth-pop"],
  "lyrics": "Ladies and gentleman of the class of 2017\\n\\nUse flat screens.\\n\\nIf I could offer you only one tip for the future, flatscreens would be it.\\n\\nThe benefits of flatscreens have been proved by Hollywood, whereas the rest of my advice has no basis more reliable than my own meandering experience.\\n\\nI will dispense this advice… now.\\n\\nEnjoy the confidence and optimism of greenfield projects. Oh, never mind. You will not appreciate the confidence and optimism of greenfield until everything starts going to hell. But trust me, when you finally ship, you’ll look back at the code you wrote and recall in a way you can’t grasp now how simple everything seemed, and how productive you really were. Your code is not as bad as you imagine.\\n\\nDon’t worry about changing database providers. Or worry, but know that every company who ever used an OR/M in case they needed to switch databases never actually did it. The real problems in your projects are the dependencies you don’t control; the leaking air conditioner that floods your data centre at 5pm on the Thursday before Christmas.\\n\\nLearn one thing every day that scares you.\\n\\nOptimise.\\n\\nDon’t reformat other people’s codebases; don’t put up with people who reformat yours.\\n\\nRebase\\n\\nDon’t get obsessed with frameworks. Sometimes they help, sometimes they hurt. It’s the user experience that matters, and the user doesn’t care how you created it.\\n\\nRemember the retweets you receive; forget the flame bait. If you succeed in doing this, tell me how.\\n\\nKeep your old hard drives. Throw away your old network cards.\\n\\nRefactor.\\n\\nDon’t feel guilty if you don’t understand F#. Some of the most productive junior developers I’ve worked with didn’t know F#. Some of the best systems architects I know still don’t.\\n\\nWrite plenty of tests.\\n\\nBe kind to your keys; you’ll miss them when they’re gone.\\n\\nMaybe you have a degree; maybe you don’t. Maybe you have an open source project; maybe you won’t. Maybe you wrote code that flew on the Space Shuttle; maybe you worked on Microsoft Sharepoint. Whatever you do, keep improving, and don’t worry where your next gig is coming from. There’s a big old world out there, and they’re always going to need good developers.\\n\\nLook after your brain. Don’t burn out, don’t be afraid to take a break. It is the most powerful computer you will ever own.\\n\\nLaunch, even if you have no users but your own QA team.\\n\\nHave a plan, even if you choose not to follow it.\\n\\nDo NOT read the comments on YouTube : they will only make you feel angry.\\n\\nCache your package dependencies; you never know when they’ll be gone for good.\\n\\nRead your log files. They’re your best source of information, and the first place you’ll notice if something’s starting to go wrong.\\n\\nUnderstand that languages come and go, and that it’s the underlying patterns that really matter. Work hard to fill the gaps in your knowledge, because the wiser you get, the more you’ll regret the things you didn’t know when you were young.\\n\\nDevelop in assembler once, but stop before it makes you smug.\\n\\nDevelop in Visual Basic once, but stop before it makes you stupid.\\n\\nRead.\\n\\nAccept certain inalienable truths. Your code has bugs, you will miss your deadlines, and you, too, might end up in management. And when you do, you’ll fantasize that back when you were a developer, code was bug-free, deadlines were met, and developers tuned their database indexes.\\n\\nTune your database indexes.\\n\\nDon’t deploy your code without testing it. Maybe you have a QA team. Maybe you have integration tests. You never know when either one might miss something.\\n\\nDon’t mess too much with your user interface, or by the time you ship, it will look like a karaoke booth.\\n\\nBe grateful for open source code, but be careful whose code you run. Writing good code is hard, and open source is a way of taking bits from your projects folder, slapping a readme on them, and hoping if you put them on GitHub somebody else will come along and fix your problems.\\n\\nBut trust me on the flatscreens.",
  "music": "\"Sunscreen\" by Baz Luhrmann",
  "year": 2017,
  "duration": 348,
  "link": "https://www.youtube.com/watch?v=q3G4EPGH2r0"
}
